# 请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。 
# 
#  
#  数字 1-9 在每一行只能出现一次。 
#  数字 1-9 在每一列只能出现一次。 
#  数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图） 
#  
# 
#  
# 
#  注意： 
# 
#  
#  一个有效的数独（部分已被填充）不一定是可解的。 
#  只需要根据以上规则，验证已经填入的数字是否有效即可。 
#  空白格用 '.' 表示。 
#  
# 
#  
# 
#  示例 1： 
# 
#  
# 输入：board = 
# [["5","3",".",".","7",".",".",".","."]
# ,["6",".",".","1","9","5",".",".","."]
# ,[".","9","8",".",".",".",".","6","."]
# ,["8",".",".",".","6",".",".",".","3"]
# ,["4",".",".","8",".","3",".",".","1"]
# ,["7",".",".",".","2",".",".",".","6"]
# ,[".","6",".",".",".",".","2","8","."]
# ,[".",".",".","4","1","9",".",".","5"]
# ,[".",".",".",".","8",".",".","7","9"]]
# 输出：true
#  
# 
#  示例 2： 
# 
#  
# 输入：board = 
# [["8","3",".",".","7",".",".",".","."]
# ,["6",".",".","1","9","5",".",".","."]
# ,[".","9","8",".",".",".",".","6","."]
# ,["8",".",".",".","6",".",".",".","3"]
# ,["4",".",".","8",".","3",".",".","1"]
# ,["7",".",".",".","2",".",".",".","6"]
# ,[".","6",".",".",".",".","2","8","."]
# ,[".",".",".","4","1","9",".",".","5"]
# ,[".",".",".",".","8",".",".","7","9"]]
# 输出：false
# 解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无
# 效的。 
# 
#  
# 
#  提示： 
# 
#  
#  board.length == 9 
#  board[i].length == 9 
#  board[i][j] 是一位数字（1-9）或者 '.' 
#  
#  Related Topics 数组 哈希表 矩阵 
#  👍 805 👎 0


# leetcode submit region begin(Prohibit modification and deletion)
class Solution(object):
    def isValidSudoku(self, board):
        """
        :type board: List[List[str]]
        :rtype: bool
        """
        lines_dict = {}
        rows_dict = {}
        block_dict = {0:{}, 1:{}, 2:{}, 3:{}, 4:{}, 5:{}, 6:{}, 7:{}, 8:{}}
        for index, line in enumerate(board):
            lines_dict[index] = {}
            for i in line:
                if lines_dict[index].get(i):
                    lines_dict[index][i] += 1
                    if i != ".":
                        return False
                else:
                    lines_dict[index][i] = 1
        for index, colomn in enumerate(board[0]):
            rows_dict[index] = {}
            for j in range(len(board)):
                if rows_dict[index].get(board[j][index]):
                    rows_dict[index][board[j][index]] += 1
                    if board[j][index] != ".":
                        return False
                else:
                    rows_dict[index][board[j][index]] = 1
        for i in range(len(board)):
            for j in range(len(board[0])):
                block_num = int(j/3) + int(i/3)*3
                if block_dict[block_num].get(board[i][j]):
                    block_dict[block_num][board[i][j]] += 1
                    if board[i][j] != ".":
                        return False
                else:
                    block_dict[block_num][board[i][j]] = 1
        return True
# leetcode submit region end(Prohibit modification and deletion)

